docs/notification-benchmark-runs/20260913-193217-f63d1963/outbox-favorite-k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: E:\goProject\library\src\GoStudy\AiDevClub\scripts\notification-benchmark.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 35s max duration (incl. graceful stop):
              * notification_write: 20 looping VUs for 30s (gracefulStop: 5s)


running (01.0s), 20/20 VUs, 17 complete and 0 interrupted iterations
notification_write   [   3% ] 20 VUs  01.0s/30s

running (02.0s), 20/20 VUs, 50 complete and 0 interrupted iterations
notification_write   [   7% ] 20 VUs  02.0s/30s

running (03.0s), 20/20 VUs, 71 complete and 0 interrupted iterations
notification_write   [  10% ] 20 VUs  03.0s/30s

running (04.0s), 20/20 VUs, 104 complete and 0 interrupted iterations
notification_write   [  13% ] 20 VUs  04.0s/30s

running (05.0s), 20/20 VUs, 134 complete and 0 interrupted iterations
notification_write   [  17% ] 20 VUs  05.0s/30s

running (06.0s), 20/20 VUs, 165 complete and 0 interrupted iterations
notification_write   [  20% ] 20 VUs  06.0s/30s

running (07.0s), 20/20 VUs, 198 complete and 0 interrupted iterations
notification_write   [  23% ] 20 VUs  07.0s/30s

running (08.0s), 20/20 VUs, 229 complete and 0 interrupted iterations
notification_write   [  27% ] 20 VUs  08.0s/30s

running (09.0s), 20/20 VUs, 255 complete and 0 interrupted iterations
notification_write   [  30% ] 20 VUs  09.0s/30s

running (10.0s), 20/20 VUs, 282 complete and 0 interrupted iterations
notification_write   [  33% ] 20 VUs  10.0s/30s

running (11.0s), 20/20 VUs, 313 complete and 0 interrupted iterations
notification_write   [  37% ] 20 VUs  11.0s/30s

running (12.0s), 20/20 VUs, 344 complete and 0 interrupted iterations
notification_write   [  40% ] 20 VUs  12.0s/30s

running (13.0s), 20/20 VUs, 373 complete and 0 interrupted iterations
notification_write   [  43% ] 20 VUs  13.0s/30s

running (14.0s), 20/20 VUs, 404 complete and 0 interrupted iterations
notification_write   [  47% ] 20 VUs  14.0s/30s

running (15.0s), 20/20 VUs, 435 complete and 0 interrupted iterations
notification_write   [  50% ] 20 VUs  15.0s/30s

running (16.0s), 20/20 VUs, 463 complete and 0 interrupted iterations
notification_write   [  53% ] 20 VUs  16.0s/30s

running (17.0s), 20/20 VUs, 497 complete and 0 interrupted iterations
notification_write   [  57% ] 20 VUs  17.0s/30s

running (18.0s), 20/20 VUs, 526 complete and 0 interrupted iterations
notification_write   [  60% ] 20 VUs  18.0s/30s

running (19.0s), 20/20 VUs, 556 complete and 0 interrupted iterations
notification_write   [  63% ] 20 VUs  19.0s/30s

running (20.0s), 20/20 VUs, 585 complete and 0 interrupted iterations
notification_write   [  67% ] 20 VUs  20.0s/30s

running (21.0s), 20/20 VUs, 618 complete and 0 interrupted iterations
notification_write   [  70% ] 20 VUs  21.0s/30s

running (22.0s), 20/20 VUs, 651 complete and 0 interrupted iterations
notification_write   [  73% ] 20 VUs  22.0s/30s

running (23.0s), 20/20 VUs, 684 complete and 0 interrupted iterations
notification_write   [  77% ] 20 VUs  23.0s/30s

running (24.0s), 20/20 VUs, 712 complete and 0 interrupted iterations
notification_write   [  80% ] 20 VUs  24.0s/30s

running (25.0s), 20/20 VUs, 742 complete and 0 interrupted iterations
notification_write   [  83% ] 20 VUs  25.0s/30s

running (26.0s), 20/20 VUs, 772 complete and 0 interrupted iterations
notification_write   [  87% ] 20 VUs  26.0s/30s

running (27.0s), 20/20 VUs, 799 complete and 0 interrupted iterations
notification_write   [  90% ] 20 VUs  27.0s/30s

running (28.0s), 20/20 VUs, 831 complete and 0 interrupted iterations
notification_write   [  93% ] 20 VUs  28.0s/30s

running (29.0s), 20/20 VUs, 857 complete and 0 interrupted iterations
notification_write   [  97% ] 20 VUs  29.0s/30s

running (30.0s), 20/20 VUs, 883 complete and 0 interrupted iterations
notification_write   [ 100% ] 20 VUs  30.0s/30s


  █ TOTAL RESULTS 

    checks_total.......: 905     29.577563/s
    checks_succeeded...: 100.00% 905 out of 905
    checks_failed......: 0.00%   0 out of 905

    ✓ favorite endpoint returns HTTP 200

    CUSTOM
    benchmark_error_rate...........: 0.00%  0 out of 905
    benchmark_request_duration.....: avg=669.75ms min=190.2ms  med=736.36ms max=1.42s p(90)=957.32ms p(95)=1.03s p(99)=1.24s
    benchmark_requests.............: 905    29.577563/s

    HTTP
    http_req_duration..............: avg=669.75ms min=190.2ms  med=736.36ms max=1.42s p(90)=957.32ms p(95)=1.03s p(99)=1.24s
      { expected_response:true }...: avg=669.75ms min=190.2ms  med=736.36ms max=1.42s p(90)=957.32ms p(95)=1.03s p(99)=1.24s
    http_req_failed................: 0.00%  0 out of 905
    http_reqs......................: 905    29.577563/s

    EXECUTION
    iteration_duration.............: avg=670.45ms min=219.55ms med=736.29ms max=1.43s p(90)=957.18ms p(95)=1.03s p(99)=1.24s
    iterations.....................: 905    29.577563/s
    vus............................: 20     min=20       max=20
    vus_max........................: 20     min=20       max=20

    NETWORK
    data_received..................: 176 kB 5.8 kB/s
    data_sent......................: 285 kB 9.3 kB/s



running (30.6s), 00/20 VUs, 905 complete and 0 interrupted iterations
notification_write ✓ [ 100% ] 20 VUs  30s